---
kind: type
id: T:Autodesk.Revit.DB.Architecture.BalusterPlacement
source: html/33c016f2-bf39-a852-052f-b1c80b0f1860.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPlacement

A class which contains information regarding baluster and post placement for a given railing type.

## Syntax (C#)
```csharp
public class BalusterPlacement : IDisposable
```